/*
 *   for ===========================>157page
 *   ----반복문
 *   ----반복횟수를 알고있는 경우에 주로 사용한다(Front-End)
 *   ----
 *      1)초기값=>처음 시작값 지정
 *      2)조건식=> 범위 ( 몇번을 수행할것인지)
 *      3)증감식=> i++ i+=2 ...
 *                   ======복합대입연산자 
 *      ==> for(초기값;조건식;증감식)
 *      {
 *            수행문장
 *            이미지출력
 *            제목출력
 *            조회수...
 *      }
 *      
 *      실행순서
 *               -----false이면 종료
 *          ① ->  ② <-  ④
 *      for(초기값;조건식;증감식)
 *      {          | 조건 true면 실행문장
 *              실행문장 ③ 
 *      }
 *      =====================================
 *      while : 반복횟수를 모르는 경우
 *              데이터베이스 프로그램, 네트워크 (서버/클라이언트)=>무한루프(서버)
 *              
 *              초기값 , 조건식, 증감식 (for) => 형식이 다름
 *         초기값 1 조건식에 대입(true/false)
 *         while(조건식)2======>false면종료/true 반복실행문장 실행
 *         {
 *             반복실행문장3
 *             증감식4==>2이동 (증가한 다음=> 조건)
 *         }
 *      
 */
//1~10==> 1증가하는 ==>출력 ==>for/while (1~10까지 출력하는 프로그램)
public class 반복문_for {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		
		for(int i=1;i<=10;i++) {
			System.out.print(i+" ");
		}
		
		System.out.println(); //다음줄에 출력
		
		int i=1;
		while(i<=10) {
			System.out.print(i+" ");
			i++;
		}

	}

}
