/*
 *    반복문 => 반복적인 소스를 모아서 한번에 처리
 *    ----------------------------------
 *    for(시작값;끝나는값;증가식)
 *    
 *    1~100
 *    for(int i=1;i<=100;i++)
 *    15~250
 *    for(int i=15;i<=250;i++)
 *    10~100 10씩증가
 *    for(int i =10;i<=100;i+=10)
 *    
 *    => 합 , 곱 , 갯수
 *      ---
 *      sum초기값:1, gop초기값:1, count초기값:0 ==>산술 연산
 *      sum+=i, gop*=i, count++
 *      -----------------------
 *      ------          -------
 *      ***              ***
 *      총구매액          구매갯수 ===>브라우저로 전송 ( 받은 값을 출력), 모바일로 전송
 *      request.setAttribute("total",10000)         {"total":10000}==> JSON
 *    => count ==> 추천(네이버, 다음, 카카오)
 *    
 *    *** 변수 ==> 초기값
 *    *** 연산자
 *    *** 제어문
 *    ----------------------메소드 (여러개=> 클래스) ==> 암기(라이브러리)
 *      형식)
 *             시작1    범위(끝)2  증감식4
 *         for(int i=1;i<=10;i++)
 *           {
 *             System.out.ptintln(i) 반복실행문장3
 *           }
 *           
 *         int i=1;
 *         while(i<=10){
 *           System.out.println(i);
 *           i++
 *           }
 *           
 *        while :무한루프(종료하지 않는 프로그램)=> while(true) :종료하는 프로그램을 첨부
 *                                          게임 :ESC
 *              => 데이터베이스 (핵심) => 80% 
 *          =>Front(for) / Back(while)
 *          
 *        형식)
 *         1초기값
 *         while(2조건식){
	 *         3반복실행문장
	 *         4증감식==>조건식2 이동
 *         }
 *         1~100 정수 출력
 *         int =1;
 *         while(i<=100){
 *           반복실행문장
 *           i++
 *         }
 *         
 *         156page~157page ==>이미지 (순서확인)
 *         156page==>(형식)
 *         167page==>while문(형식), 순서
 */
public class 반복문정리 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
